Revit 2027 API
ElectricalDemandFactorDefinition.RuleType Property
 The rule type for this demand factor definition.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalDemandFactorRule RuleType { get; set; }
Public Property RuleType As ElectricalDemandFactorRule
	Get
	Set
public:
property ElectricalDemandFactorRule RuleType {
	ElectricalDemandFactorRule get ();
	void set (ElectricalDemandFactorRule value);
}
member RuleType : ElectricalDemandFactorRule with get, set
Property Value
ElectricalDemandFactorRule
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace